# 1. Збери декілька текстів англійської мови. Наприклад звернення Президента з телеграму, або щось із твітеру, новин.
# 2. Запиши англійські тексти у текстовий файл
# 3. Відкрити текстовий файл, зчитати інформацію та перекласти на українську мову, нижче кинув туторіал, доволі просто.
# 4. Навмисно програмою придумати якісь помилки у виниклому перекладі, або ж вони можуть там з‘явитися самі собою, наприклад:
#     1. Після розділових знаків може не бути пробілу.
#     2. Слова з дефісом можуть записуватись як "Нью -Йорк".
#     3. Перед словом що не завжди стоїть кома(вона і не завжди потрібна, але в переважній більшості випадків - так).
# 5. Виправити ці та інші можливі помилки.
# 6. Отримати готовий і відредагований текст, який буде записано у текстовий файл із назвою _translated
# 7. Бонус! Зробити так, щоб програма виводила:
#     1. Найдовше речення з перекладеного тексту.
#     2. Кількість слів у цьому тексті.
#     3. Топ найбільш вживаних слів. (edited)

import googletrans
from googletrans import Translator

print(googletrans.LANGUAGES)

# with open('texts.txt', 'r') as text_file:
#     text = text_file.read()
#     print(text)

translator = Translator()

result = translator.translate('hello world')

print(result.src)
print(result.dest)
print(result.origin)
print(result.text)
print(result.pronunciation)
